       IDENTIFICATION DIVISION.
       PROGRAM-ID. InCollege.
       AUTHOR. Rafael Hernandez Vantuyl, Andy Ho, Steven Huynh, Joanna
       Johnson, Lynberg Jean.
       DATE-WRITTEN. September 4th, 2026.



       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT INPUT_FILE 
           ASSIGN TO
       DATA DIVISION.
       WORKING-STORAGE SECTION.
           